<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"26b6de7af5183bbe8499b5d683a068e3c264c0a50e95222d0d7948b90f63dd2e","plan_job_ref":"Job plan #16 at https://github.com/GSA/usnotify-ssb/actions/runs/4917044398","plan_hash":"65ce3877527442b486ccad5e96e02751a2e86aa36dd173cd90f590bb8a23cc77","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                       = "binary_buildpack"
      + command                         = "source .profile && ./cloud-service-broker serve"
      + disk_quota                      = 2048
      + enable_ssh                      = true
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 256
      + name                            = "ssb-sms"
      + path                            = "./app-ssb-sms.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "I6Kpq+JzVlzxHC16zHAwQgB8YrcotCVUnYVyCN/TZf0="
      + space                           = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + stack                           = "cflinuxfs4"
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = "3d524868-7061-4ab6-8048-c97c775df9a9"
        }

      + service_binding {
          + service_instance = "7306071e-b8a1-4a5a-8515-70c95168bb06"
        }
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                       = "binary_buildpack"
      + command                         = "source .profile && ./cloud-service-broker serve"
      + disk_quota                      = 2048
      + enable_ssh                      = true
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 256
      + name                            = "ssb-smtp"
      + path                            = "./app-ssb-smtp.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "OfGBYaIM6hHzeGqV0dDVPgkeozKZDgjBx0hkCzOK2sc="
      + space                           = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + stack                           = "cflinuxfs4"
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = "4dde2fc3-7d82-4c81-8e92-d4920fcd4510"
        }

      + service_binding {
          + service_instance = "4dc86e07-7c24-4acb-b861-7cbd444a7c31"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [apply #17](https://github.com/GSA/usnotify-ssb/actions/runs/4917243482)